[
  {
    "id": 1,
    "model": "Submariner Date",
    "brand": "Rolex",
    "star_review": 4.9,
    "price": 13400,
    "image_link": "rolex-subm-date.png",
    "description": "The Rolex Submariner Date is a benchmark in professional diver’s watches, featuring a 41 mm Oystersteel case and a unidirectional rotatable Cerachrom bezel in black ceramic. Built to endure extreme underwater pressure, it offers water resistance up to 300 meters. Its Chromalight display provides exceptional legibility in dark environments, while the signature Cyclops lens magnifies the date display for easy reading. A true icon of functionality and elegance, the Submariner Date combines technical mastery with timeless Rolex design.",
    "case_size": "41mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 2,
    "model": "Day-Date 40",
    "brand": "Rolex",
    "star_review": 4.8,
    "price": 38500,
    "image_link": "rolex-day-date-40.png",
    "description": "The Rolex Day-Date 40 is the signature “President” model, crafted in precious metal and distinguished by its full calendar display showing both the date and the spelled-out day of the week. With a 40 mm case and the calibre certified as a Superlative Chronometer, it epitomises luxury, refinement and technical accuracy.",
    "case_size": "40mm",
    "category": ["Men's", "Formal"]
  },
  {
    "id": 3,
    "model": "GMT-Master II Pepsi",
    "brand": "Rolex",
    "star_review": 4.7,
    "price": 16700,
    "image_link": "rolex-gmt-pepsi.png",
    "description": "The Rolex GMT-Master II “Pepsi” pairs the iconic red-and-blue 24-hour bezel with a dual time-zone mechanism, making it both a practical traveller’s tool and a collector’s favourite. The 24-hour hand and rotating bezel allow tracking of two time-zones at a glance, housed in the familiar Oystersteel case at Rolex’s famed build quality.",
    "case_size": "40mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 4,
    "model": "Oyster Perpetual 36",
    "brand": "Rolex",
    "star_review": 4.5,
    "price": 6700,
    "image_link": "rolex-oyster-36.png",
    "description": "The Rolex Oyster Perpetual 36 is a sleek, uncomplicated dress-sports watch with a 36 mm Oyster case, automatic movement and the hallmark Oyster bracelet. With its minimalist dial and robust build, it offers luxury-watch pedigree in a refined, everyday wearable size.",
    "case_size": "36mm",
    "category": ["Men's", "Women's", "Formal"]
  },
  {
    "id": 5,
    "model": "Cosmograph Daytona",
    "brand": "Rolex",
    "star_review": 5.0,
    "price": 32400,
    "image_link": "rolex-cosmo-day.png",
    "description": "The Rolex Cosmograph Daytona is an icon of motor-sport chronographs, featuring a high-precision chronograph movement, tachymetric bezel, and dial layout tailored for timing racing events. With its association to endurance racing and timeless design, it sits at the pinnacle of Rolex’s sport watch collection.",
    "case_size": "40mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 6,
    "model": "RM 11-03 Automatic Flyback Chronograph",
    "brand": "Richard Mille",
    "star_review": 4.9,
    "price": 220000,
    "image_link": "rm-11-03.png",
    "description": "The RM 11-03 is a technical marvel in haute horology, featuring a skeletonised automatic movement with fly-back chronograph, 60-minute countdown timer, 12-hour totaliser, oversize date and variable geometry rotor. Crafted in materials like grade 5 titanium and often Carbon TPT®, its tonneau-shaped case blends racing aesthetics with cutting-edge watchmaking.",
    "case_size": "49.94 x 44.5mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 7,
    "model": "RM 35-02 Rafael Nadal",
    "brand": "Richard Mille",
    "star_review": 4.8,
    "price": 180000,
    "image_link": "rm-35-02.png",
    "description": "The Richard Mille RM 35-02 Rafael Nadal is a sporty, robust timepiece built for performance, with advanced materials such as Carbon TPT®, a skeletonised movement, and an aesthetic inspired by elite athlete environments. It offers a bold visual statement and mechanical sophistication in equal measure.",
    "case_size": "44.5 x 49.94mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 8,
    "model": "RM 055 Bubba Watson",
    "brand": "Richard Mille",
    "star_review": 4.7,
    "price": 150000,
    "image_link": "rm-055.png",
    "description": "The Richard Mille RM 055 Bubba Watson exemplifies the fusion of luxury and sport, developed in collaboration with a professional golfer. With a lightweight case built from advanced composite materials and a skeletonised movement, it stands out as a watch capable of handling high-stress sporting conditions while retaining haute horology finishes.",
    "case_size": "42.70 x 49.90mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 9,
    "model": "RM 07-01 Ladies Automatic",
    "brand": "Richard Mille",
    "star_review": 4.6,
    "price": 125000,
    "image_link": "rm-07-01.png",
    "description": "The Richard Mille RM 07-01 Ladies Automatic blends elegance and technical prowess with an automatic movement, a tonneau case in precious or high-tech materials and refined finishing. Designed for the discerning collector who demands both style and mechanical excellence.",
    "case_size": "31.40 x 42.53mm",
    "category": ["Women's", "Formal"]
  },
  {
    "id": 10,
    "model": "RM 65-01 Split Seconds Chronograph",
    "brand": "Richard Mille",
    "star_review": 5.0,
    "price": 310000,
    "image_link": "rm-65-01.png",
    "description": "The Richard Mille RM 65-01 Split Seconds Chronograph is a pinnacle of horological complication, offering a split-seconds (rattrapante) chronograph, automatic winding and high-grade finishing. With performance-driven materials and a bold design, this piece commands respect both on technical merit and aesthetic ambition.",
    "case_size": "44.5 x 49.94mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 11,
    "model": "Prospex Turtle SRP777",
    "brand": "Seiko",
    "star_review": 4.5,
    "price": 10000,
    "image_link": "seiko-prospex-turtle.png",
    "description": "The Seiko Prospex Turtle SRP777 is a modern reinterpretation of Seiko’s legendary ‘Turtle’ dive-watch design from the 1970s. With a cushion-shaped stainless-steel case (~44.3 mm), 200 m water-resistance, Hardlex crystal and automatic 4R36 movement, it delivers serious dive-watch credentials at an accessible price point.",
    "case_size": "44.3mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 12,
    "model": "Presage Cocktail Time SRPB43",
    "brand": "Seiko",
    "star_review": 4.6,
    "price": 8990,
    "image_link": "seiko-presage.png",
    "description": "The Seiko Presage Cocktail Time SRPB43 channels classic cocktail-hour sophistication into a mechanical watch, featuring a sunburst dial, automatic movement, sleek polished case and dress-sport versatility. It’s a refined choice for those seeking value and elegance in a mechanical watch.",
    "case_size": "40.5mm",
    "category": ["Men's", "Formal"]
  },
  {
    "id": 13,
    "model": "Seiko 5 Sports SRPD55",
    "brand": "Seiko",
    "star_review": 4.4,
    "price": 15000,
    "image_link": "seiko-5-sports.png",
    "description": "The Seiko 5 Sports SRPD55 offers an entry-level mechanical sports watch with a heritage of reliability. With generous styling, automatic 4R36-based movement, day-date complication and robust build, it’s a strong choice for everyday wear on a budget.",
    "case_size": "42.5mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 14,
    "model": "Astron GPS Solar SSH003",
    "brand": "Seiko",
    "star_review": 4.7,
    "price": 250000,
    "image_link": "seiko-astron.png",
    "description": "The Seiko Astron GPS Solar SSH003 utilises GPS satellite reception to automatically adjust the time and zone worldwide, powered entirely by light. With its high-tech quartz movement, premium finishing and global practicality, it’s ideal for frequent travellers wanting precision and convenience.",
    "case_size": "42.7mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 15,
    "model": "King Seiko SPB281",
    "brand": "Seiko",
    "star_review": 4.8,
    "price": 350000,
    "image_link": "seiko-king.png",
    "description": "The Seiko King Seiko SPB281 revives a storied name from Seiko’s mid-20th century line-up, offering refined finishing, sharp dial textures, the in-house automatic movement and heritage styling. It strikes a balance between dress and sport, making it a versatile daily wearer with collector appeal.",
    "case_size": "38.5mm",
    "category": ["Men's", "Formal"]
  },
  {
    "id": 16,
    "model": "G-Shock GA-2100-1A1",
    "brand": "Casio",
    "star_review": 4.6,
    "price": 110000,
    "image_link": "casio-ga-2100-1a1.png",
    "description": "The Casio G-Shock GA-2100-1A1 brings the rugged, shock-resistant heritage of G-Shock into a slimmer, trendy ‘CasiOak’ style case. With digital-analog display, 200 m water-resistance, carbon-core guard structure and affordable pricing, it’s a stylish and durable pick for everyday adventure.",
    "case_size": "45.4mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 17,
    "model": "G-Shock DW-5600E-1V",
    "brand": "Casio",
    "star_review": 4.7,
    "price": 60000,
    "image_link": "casio-dw-5600e.png",
    "description": "The Casio G-Shock DW-5600E-1V is the modern iteration of the original DW-5000 design, offering iconic square-case styling, 200 m water-resistance, shock-proof build and high reliability at an ultra-accessible price. A strong value in the G-Shock family.",
    "case_size": "42.8mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 18,
    "model": "Casio Vintage A168WG-9",
    "brand": "Casio",
    "star_review": 4.5,
    "price": 45000,
    "image_link": "casio-a168wg.png",
    "description": "The Casio Vintage A168WG-9 offers a retro digital display in gold-tone styling, featuring alarm, stopwatch, back-light, durable bracelet and an unmistakable ’80s aesthetic. Ideal for those wanting a nostalgic, everyday digital watch with character.",
    "case_size": "36.3mm",
    "category": ["Men's", "Women's", "Sportswear"]
  },
  {
    "id": 19,
    "model": "Edifice EQB-1000D-1A",
    "brand": "Casio",
    "star_review": 4.6,
    "price": 330000,
    "image_link": "casio-edifice.png",
    "description": "The Casio Edifice EQB-1000D-1A blends sporty chronograph styling with smart-function connectivity, featuring Bluetooth smartphone linkage, solar charging, metal case/bracelet and multi-dial time-keeping. A tech-friendly choice for those who appreciate both analog and digital integration.",
    "case_size": "45.6mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 20,
    "model": "Pro Trek PRG-600YB-3",
    "brand": "Casio",
    "star_review": 4.7,
    "price": 30000,
    "image_link": "casio-pro-trek.png",
    "description": "The Casio Pro Trek PRG-600YB-3 is built for the outdoors — featuring triple-sensor (altimeter/barometer/compass), Tough Solar, rugged resin/metal construction, and high-visibility dial. Perfect for hiking, adventure and functional utility in a wearable form.",
    "case_size": "51.6mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 21,
    "model": "Speedmaster Moonwatch Professional",
    "brand": "Omega",
    "star_review": 5.0,
    "price": 76000,
    "image_link": "omega-speed-moon.png",
    "description": "The Omega Speedmaster Moonwatch Professional holds horological legend status as the chronograph worn during NASA’s lunar missions. With manual-wind movement, hesalite (or sapphire) crystal, robust steel case, and heritage styling, it remains a timeless statement of space-age achievement and mechanical precision.",
    "case_size": "42mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 22,
    "model": "Seamaster Diver 300M",
    "brand": "Omega",
    "star_review": 4.8,
    "price": 61000,
    "image_link": "omega-seam-300m.png",
    "description": "The Omega Seamaster Diver 300M is a premium dive watch offering 300 m water-resistance, helium escape valve, ceramic bezel, and the in-house Master Chronometer calibre certified for magnetic-resistance and precision. A refined yet sporty option from Omega’s iconic dive-watch heritage.",
    "case_size": "42mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 23,
    "model": "Aqua Terra 150M Co-Axial",
    "brand": "Omega",
    "star_review": 4.7,
    "price": 254000,
    "image_link": "omega-aqua-150m.png",
    "description": "The Omega Aqua Terra 150M Co-Axial merges dress and sport, with clean dial aesthetics, 150 m water-resistance, and the Co-Axial automatic movement known for durability and precision. A versatile timepiece suitable for daily wear, business or casual occasions.",
    "case_size": "41mm",
    "category": ["Men's", "Formal"]
  },
  {
    "id": 24,
    "model": "Constellation Co-Axial Master Chronometer",
    "brand": "Omega",
    "star_review": 4.9,
    "price": 272200,
    "image_link": "omega-constellation.png",
    "description": "The Omega Constellation Co-Axial Master Chronometer is a refined dress-watch with the signature ‘Griffes’ or claws at the lugs, sleek case profile, and Master Chronometer movement certified to high magnetic-resistance and chronometric performance. Ideal for the wearer seeking minimalist luxury with technical credentials.",
    "case_size": "39mm",
    "category": ["Men's", "Formal"]
  },
  {
    "id": 25,
    "model": "De Ville Prestige",
    "brand": "Omega",
    "star_review": 4.6,
    "price": 250000,
    "image_link": "omega-de-ville.png",
    "description": "The Omega De Ville Prestige offers elegant styling, fine finishing, a slim profile and automatic or quartz movements depending on variant. With its traditional looks and high-end craftsmanship, it’s a strong choice for formal occasions or refined daily wear.",
    "case_size": "39.5mm",
    "category": ["Men's", "Formal"]
  },
  {
    "id": 26,
    "model": "G-Shock GA-B2100-1A",
    "brand": "Casio",
    "star_review": 4.5,
    "price": 120000,
    "image_link": "casio-ga-2100-1a.png",
    "description": "The Casio G-Shock GA-B2100-1A builds on the popular ‘CasiOak’ design with carbon-core guard structure, Bluetooth connectivity for smartphone sync, solar power and 200 m water-resistance. A modern twist on G-Shock durability and connectivity.",
    "case_size": "48.5mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 27,
    "model": "Grand Seiko Snowflake SBGA211",
    "brand": "Seiko",
    "star_review": 5.0,
    "price": 520800,
    "image_link": "seiko-grand.png",
    "description": "The Grand Seiko Snowflake SBGA211 features Seiko’s signature Spring-Drive movement, a titanium case and bracelet, and a uniquely textured white dial reminiscent of fresh snow. With this exquisite finishing and in-house technology, it blends artistry and horology at an exceptional value.",
    "case_size": "41mm",
    "category": ["Men's", "Formal"]
  },
  {
    "id": 28,
    "model": "Rolex Explorer II",
    "brand": "Rolex",
    "star_review": 4.7,
    "price": 103000,
    "image_link": "rolex-explorer-ii.png",
    "description": "The Rolex Explorer II is a rugged professional tool watch originally designed for spelunkers and adventurers, featuring a 24-hour hand and fixed bezel to distinguish between day and night in dark environments. With a robust steel case, luminous markers, and the reliability expected from Rolex, it’s built for exploration.",
    "case_size": "42mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 29,
    "model": "RM 72-01 Lifestyle Chronograph",
    "brand": "Richard Mille",
    "star_review": 4.9,
    "price": 250000,
    "image_link": "rm-72-01.png",
    "description": "The Richard Mille RM 72-01 Lifestyle Chronograph stands out with its ultra-lightcase crafted from carbon or high-tech composite materials, integrated chronograph mechanism developed in-house, and open-worked aesthetic that merges haute horology with avant-garde styling. A true statement piece for collectors.",
    "case_size": "38.40 x 47.34mm",
    "category": ["Men's", "Sportswear"]
  },
  {
    "id": 30,
    "model": "Omega Seamaster Planet Ocean 600M",
    "brand": "Omega",
    "star_review": 4.8,
    "price": 74000,
    "image_link": "omega-seam-planet.png",
    "description": "The Omega Seamaster Planet Ocean 600M is a high-performance diver’s watch with 600 metres of water-resistance, helium escape valve, ceramic bezel, and bold styling for those seeking serious under-sea credentials paired with luxury finishes.",
    "case_size": "43.5mm",
    "category": ["Men's", "Sportswear"]
  }
]